#types
# age = "21" #문자
# age1 = 21  #숫자
# age2 = 10  #숫자
# print(f"두 수의 합 {age1 + age2}")
# num = input("입력:")
# num1 = input("입력:")
# print(f"{num + num1}")

# name = "jeon" #문자
# age = 24 #숫자
# age1 = 20
# age2 = "20"
# age3 = "21"
# a = input("숫자:") #문자
# print(f"{age + age1}") # 44
# print(f"{age2 + age3}") # 2021

# 숫자형 타입
a = 10 # 정수형 (int)
b = 3.14 # 실수형 (float)
# 문자형 타입
c = "mega"
d = 'coffee'
e = """(문경=연합뉴스) 김선형 박세진 기자 = 경북도소방본부는 1일 문경 육가공 제조업체 화재 현장에서 순직한 소방관들에 대해 1계급 특진과 옥조근정훈장 추서, 국립현충원 안장을 추진한다고 밝혔다.

도 소방본부는 불길 속에서 인명을 구조하다 숨진 경북 문경소방서 119 구조구급센터 소속 김수광 소방교(27)와 박수훈 소방사(35)에게 애도와 경의를 표하고, '경상북도 순직 소방공무원 등 장례 지원에 관한 조례'에 따라 장례 절차를 진행하기로 했다.

주민 신고로 화재 현장에 가장 먼저 도착한 이들은 화재가 발생한 공장에서 사람이 대피하는 것을 발견하고 건물 내부 인명 검색이 필요하다고 판단해 수색에 돌입했다.

공장 건물 안에서 인명을 검색하던 중 급격한 연소 확대로 건물 내부에 고립됐으며, 곧이어 붕괴하는 건물에서 탈출하지 못하는 참변을 당했다.

소방 당국은 고립된 이들을 구하기 위해 최선을 다했으나 끝내 주검으로 발견됐다."""


# 불린형 (True or False)
isCoffee = True
isHot = False

























